

// ===============================================================================
//
// Библиотека для преобразования строки C-типа в число типа float32 (IEEE 754)
//
// -------------------------------------------------------------------------------
//
// Library for converting C-type strings to float32 number (IEEE 754)
//
// ===============================================================================


#ifndef ATOF_H_
#define ATOF_H_

#include <stdint.h>
#include <stddef.h>


// ===============================================================================


float ATOF_String_To_Float32(char* string, uint8_t max_string_len);


#endif



